Babak-Zia/AM2612_DualCore/Core0-freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM261x_ZFG" --part "AM2612" --package "ZFG" --context "r5fss0-0" --product "INDUSTRIAL_COMMUNICATIONS_SDK_AM261x@2025.00.00" --product "MCU_PLUS_SDK_AM261x@26.00.00"
 * @v2CliArgs --device "AM2612" --package "NFBGA (ZFG)" --variant "500MHz" --context "r5fss0-0" --product "INDUSTRIAL_COMMUNICATIONS_SDK_AM261x@2025.00.00" --product "MCU_PLUS_SDK_AM261x@26.00.00"
 * @versions {"tool":"1.27.1+4634"}
 */

/**
 * Import the modules used in this configuration.
 */
const eeprom          = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1         = eeprom.addInstance();
const eeprom2         = eeprom.addInstance();
const flash           = scripting.addModule("/board/flash/flash", {}, false);
const flash1          = flash.addInstance();
const ioexp           = scripting.addModule("/board/ioexp/ioexp", {}, false);
const ioexp1          = ioexp.addInstance();
const ioexp2          = ioexp.addInstance();
const led             = scripting.addModule("/board/led/led", {}, false);
const led1            = led.addInstance();
const led2            = led.addInstance();
const edma            = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1           = edma.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const i2c             = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1            = i2c.addInstance();
const i2c2            = i2c.addInstance();
const ipc             = scripting.addModule("/drivers/ipc/ipc");
const ethercat        = scripting.addModule("/industrial_comms/ethercat/ethercat", {}, false);
const ethercat1       = ethercat.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const mpu_armv77      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name      = "CONFIG_EEPROM0";
eeprom1.i2cAddress = 0x53;

eeprom2.$name      = "CONFIG_EEPROM1";
eeprom2.i2cAddress = 0x51;

flash1.$name                                    = "CONFIG_FLASH0";
flash1.enableFlashReset                         = true;
flash1.peripheralDriver.$name                   = "CONFIG_OSPI0";
flash1.peripheralDriver.phyEnable               = true;
flash1.peripheralDriver.OSPI.$assign            = "OSPI0";
flash1.peripheralDriver.OSPI.CLK.$assign        = "GPIO10";
flash1.peripheralDriver.OSPI.CSn0.$assign       = "GPIO62";
flash1.peripheralDriver.OSPI.DQS.$assign        = "GPIO9";
flash1.peripheralDriver.OSPI.D7.$assign         = "GPIO68";
flash1.peripheralDriver.OSPI.D6.$assign         = "GPIO8";
flash1.peripheralDriver.OSPI.D5.$assign         = "GPIO67";
flash1.peripheralDriver.OSPI.D4.$assign         = "GPIO76";
flash1.peripheralDriver.OSPI.D3.$assign         = "GPIO69";
flash1.peripheralDriver.OSPI.D2.$assign         = "GPIO7";
flash1.peripheralDriver.OSPI.D1.$assign         = "GPIO70";
flash1.peripheralDriver.OSPI.D0.$assign         = "GPIO2";
flash1.peripheralDriver.OSPI.RESET_OUT0.$assign = "GPIO61";
flash1.peripheralDriver.child.$name             = "drivers_ospi_v0_ospi_v0_am261x_template1";

ioexp1.$name      = "CONFIG_IOEXP0";
ioexp1.i2cAddress = "LP-RevA 0x20";

ioexp2.$name                                       = "CONFIG_IOEXP1";
ioexp2.i2cAddress                                  = "LP-RevA 0x21";
ioexp2.TCA6408ARGT_port0_pinMDIO_MDC_MUX_SEL_mode  = 0;
ioexp2.TCA6408ARGT_port0_pinMDIO_MDC_MUX_SEL_state = 1;

led1.$name      = "CONFIG_LED_DIGITAL_OUTPUT";
led1.name       = "TPIC2810";
led1.i2cAddress = 0x61;

led2.$name = "CONFIG_LED_RUN";

edma1.$name                 = "CONFIG_EDMA0";
edma1.edmaRmDmaCh[0].$name  = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name    = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name  = "CONFIG_EDMA_RM3";

gpio1.$name           = "CONFIG_GPIO0";
gpio1.pinDir          = "OUTPUT";
led2.peripheralDriver = gpio1;

eeprom1.peripheralDriver = i2c1;
i2c1.$name               = "CONFIG_I2C0";
ioexp1.peripheralDriver  = i2c1;
eeprom2.peripheralDriver = i2c1;
ioexp2.peripheralDriver  = i2c1;
i2c1.I2C.$assign         = "I2C0";
i2c1.I2C.SCL.$assign     = "GPIO135";
i2c1.I2C.SDA.$assign     = "GPIO134";
i2c1.I2C_child.$name     = "drivers_i2c_v1_i2c_v1_template0";

i2c2.$name            = "CONFIG_I2C1";
led1.peripheralDriver = i2c2;
i2c2.I2C.$assign      = "I2C1";
i2c2.I2C.SCL.$assign  = "GPIO23";
i2c2.I2C.SDA.$assign  = "GPIO24";
i2c2.I2C_child.$name  = "drivers_i2c_v1_i2c_v1_template1";

ipc.r5fss0_1 = "notify";

ethercat1.$name                                                = "CONFIG_ETHERCAT0";
ethercat1["PRU-ICSS0-IEP"].PR0_IEP0_EDIO_DATA_IN_OUT31.$assign = "GPIO120";
ethercat1.ethphy[0].$name                                      = "CONFIG_ETHPHY0";
ethercat1.ethphy[0].mdioPort                                   = 3;
ethercat1.ethphy[1].$name                                      = "CONFIG_ETHPHY1";
ethercat1.ethphy[1].mdioPort                                   = 12;

const pruicss                            = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1                           = pruicss.addInstance({}, false);
pruicss1.$name                           = "CONFIG_PRU_ICSS0";
ethercat1.icss                           = pruicss1;
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO0";

debug_log.enableUartLog            = true;
debug_log.enableCssLog             = false;
debug_log.enableSharedMemLog       = true;
debug_log.enableSharedMemLogReader = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.baudRate         = 921600;
debug_log.uartLog.UART.$assign     = "UART0";
debug_log.uartLog.UART.RXD.$assign = "GPIO27";
debug_log.uartLog.UART.TXD.$assign = "GPIO28";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.attributes        = "Device";
mpu_armv71.allowExecute      = false;

